Documents/ЛМ_ЭкспрессНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ЛМ_ЭкспрессНакладная</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехнологияДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ТехнологииДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Адреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Адреса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицоПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородОтправителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГородПолучателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъявленнаяСтоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ОписанияГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поддон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Поддоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СопровождающиеДокументы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлательщикОбратнойДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыПлательщиковОбратнойДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбратнойДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВидыОбратнойДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаОбратнойДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВременнойИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_ВременныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуботняяДоставка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаборДоверенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаДеньВДень</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЖелаемаяДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Экспедирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОбратнойДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распечатан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТТН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Длина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Высота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическийВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбратнаяДоставкаПоддонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поддон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Поддоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШиныИДиски</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШиныДиски</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_ШиныИДиски</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛМ_КонтрагентыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛМ_КонтрагентыДоставки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонтрагентДоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛМ_Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЛМ_ЭкспрессНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ОчиститьПолучателя()
	Объект.Получатель = Справочники.ЛМ_Контрагенты.ПустаяСсылка();
	Объект.АдресПолучателя = Справочники.ЛМ_Адреса.ПустаяСсылка();
	Объект.КонтактноеЛицоПолучателя = Справочники.ЛМ_КонтактныеЛица.ПустаяСсылка();
КонецПроцедуры	
	
&НаКлиенте
Процедура НаименованиеКонтрагентаПриИзменении(Элемент)
	ОчиститьПолучателя();
КонецПроцедуры

&НаСервере
Процедура ОчиститьКонтактноеЛицоПолучателя()
	Объект.КонтактноеЛицоПолучателя = Справочники.ЛМ_КонтактныеЛица.ПустаяСсылка();
КонецПроцедуры 	

&НаКлиенте
Процедура ФамилияПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаКлиенте
Процедура ИмяПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПолучателяПриИзменении(Элемент)
	ОчиститьКонтактноеЛицоПолучателя()
КонецПроцедуры

&НаСервере
Процедура УстановитьНаименованиеКонтрагента()
	Объект.НаименованиеКонтрагента = Объект.Получатель.Наименование;
КонецПроцедуры	

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ВыборКонтрагентаДоставки(ВыбранныйКОнтрагент)
	Объект.Получатель = ВыбранныйКОнтрагент;
	Объект.НаименованиеКонтрагента = ВыбранныйКОнтрагент.Наименование;
	Объект.ГородПолучателя = ВыбранныйКОнтрагент.Город;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЛМ_КонтактныеЛица.Ссылка,
	|	ЛМ_КонтактныеЛица.Фамилия,
	|	ЛМ_КонтактныеЛица.Отчество,
	|	ЛМ_КонтактныеЛица.Имя,
	|	ЛМ_КонтактныеЛица.Телефон
	|ИЗ
	|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
	|ГДЕ
	|	ЛМ_КонтактныеЛица.ПометкаУдаления = ЛОЖЬ
	|	И ЛМ_КонтактныеЛица.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ВыбранныйКОнтрагент);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.КонтактноеЛицоПолучателя = Выборка.Ссылка;
		Объект.ИмяПолучателя = Выборка.Имя;
		Объект.ФамилияПолучателя = Выборка.Фамилия;
		Объект.ОтчествоПолучателя = Выборка.Отчество;
		Объект.ТелефонПолучателя = Выборка.Телефон;
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьКонтрагентовДляОтбора()
	Если ЗначениеЗаполнено(Объект.ДокументОснование) тогда
		Если Объект.ДокументОснование.Метаданные().Реквизиты.Найти("Контрагент") <> Неопределено Тогда
			Если ЗначениеЗаполнено(Объект.ДокументОснование.Контрагент) Тогда
				Запрос = Новый Запрос;
				Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	ЛМ_КонтрагентыДоставки.КонтрагентДоставки
				|ИЗ
				|	РегистрСведений.ЛМ_КонтрагентыДоставки КАК ЛМ_КонтрагентыДоставки
				|ГДЕ
				|	ЛМ_КонтрагентыДоставки.Контрагент = &Контрагент";
				Запрос.УстановитьПараметр("Контрагент", Объект.ДокументОснование.Контрагент);
				Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("КонтрагентДоставки");
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
КонецФункции	

&НаСервере
Функция КонтрагентОснования()
	Если ЗначениеЗаполнено(Объект.ДокументОснование.Контрагент) Тогда
		Возврат Объект.ДокументОснование.Контрагент;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
КонецФункции	

&НаКлиенте
Процедура НаименованиеКонтрагентаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ФормаВыбора = ПолучитьФорму("Справочник.ЛМ_Контрагенты.ФормаВыбора");
	//КонтрагентыОтбора = ПолучитьКонтрагентовДляОтбора();
	//Если КонтрагентыОтбора <> Неопределено Тогда
	КонтрагентОснования = КонтрагентОснования();
	Если НЕ КонтрагентОснования = Неопределено Тогда
		ЭлементОтбора = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = КонтрагентОснования;
		ЭлементОтбора.Использование = Истина;
	КонецЕсли;	
	Рез = ФормаВыбора.ОткрытьМодально();
	Если Рез <> Неопределено Тогда
		ВыборКонтрагентаДоставки(Рез);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ОтправитьДокументСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.ВыгрузитьЭкспрессНакладную();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьДокумент(Команда)
	ОтправитьДокументСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭкспрессНакладной(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ГУИД) Тогда
		Сообщить("Докумен не отправлен в информационную систему службы доставки");
		Возврат;
	КонецЕсли;	
	
	//ФормаХТМЛ = ПолучитьФорму("Документ.ЛМ_ЭкспрессНакладная.Форма.ФормаПечатиХТМЛ");
	ЗапуститьПриложение("https://my.novaposhta.ua/orders/printDocument/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ());
	//Возврат;
	//ФормаХТМЛ.ХТМЛ = "https://my.novaposhta.ua/orders/printDocument/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ();
	//ФормаХТМЛ.Заголовок = "Печать экспресс-накладной " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	//ФормаХТМЛ.Открыть();
	УстанвоитьПризнакРаспечатан();
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМаркировки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ГУИД) Тогда
		Сообщить("Докумен не отправлен в информационную систему службы доставки");
		Возврат;
	КонецЕсли;	
	
	ЗапуститьПриложение("https://my.novaposhta.ua/orders/printMarkings/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ());
	
	//ФормаХТМЛ = ПолучитьФорму("Документ.ЛМ_ЭкспрессНакладная.Форма.ФормаПечатиХТМЛ");
	//ФормаХТМЛ.ХТМЛ = "https://my.novaposhta.ua/orders/printMarkings/orders[]/" + Объект.ГУИД + "/type/html/apiKey/" + КлючАПИ();
	//ФормаХТМЛ.Заголовок = "Печать маркировки " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ=dd.MM.yyyy");
	//ФормаХТМЛ.Открыть();
	УстанвоитьПризнакРаспечатан();
    УстановитьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстанвоитьПризнакРаспечатан()
	Об = РеквизитФормыВЗначение("Объект");
	Об.Распечатан = истина;
	Об.Записать();
	ЗначениеВРеквизитФормы(Об,"Объект");
КонецПроцедуры	

&НаСервере
Функция КлючАПИ()
	Возврат Константы.ЛМ_КлючAPI.Получить();	
КонецФункции	

&НаСервере
Функция ПолучитьТекстДокумента(ИмяПечФормы)
	Об = РеквизитФормыВЗначение("Объект");
	Возврат Об.Печать(ИмяПечФормы);
	//ЗначениеВРеквизитФормы(Об, "Объект");
КонецФункции

&НаСервере
Процедура УдалитьДокументСервер()
	Об = РеквизитФормыВЗначение("Объект");
	Об.УдалитьДокумент();
	ЗначениеВРеквизитФормы(Об, "Объект");
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьДокумент(Команда)
	Если Вопрос("Вы действительно хотите удалить документ из информационной системы службы доставки?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		УдалитьДокументСервер();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность()
	Если Объект.Распечатан Тогда
		ТолькоПросмотр = Истина;
	Иначе	
		ТолькоПросмотр = Ложь;
	КонецЕсли;	
	Если Объект.ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ Объект.ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		Элементы.СкладОтправителя.ТолькоПросмотр = Истина;
		Элементы.АдресОтправителя.ТолькоПросмотр = Ложь;
	ИначеЕсли 	Объект.ТехнологияДоставки.ГУИД = "WarehouseWarehouse" ИЛИ Объект.ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		Элементы.СкладОтправителя.ТолькоПросмотр = Ложь;
		Элементы.АдресОтправителя.ТолькоПросмотр = Истина;
	КонецЕсли;	
	
	Если Объект.ТехнологияДоставки.ГУИД = "DoorsDoors" ИЛИ Объект.ТехнологияДоставки.ГУИД = "WarehouseDoors" Тогда
		Элементы.СкладПолучателя.ТолькоПросмотр = Истина;
		Элементы.АдресПолучателя.ТолькоПросмотр = Ложь;
	ИначеЕсли 	Объект.ТехнологияДоставки.ГУИД = "WarehouseWarehouse" ИЛИ Объект.ТехнологияДоставки.ГУИД = "DoorsWarehouse" Тогда
		Элементы.СкладПолучателя.ТолькоПросмотр = Ложь;
		Элементы.АдресПолучателя.ТолькоПросмотр = Истина;
	КонецЕсли;	
    Заголовок = "Экспресс накладная " + Объект.Номер + " от " + Формат(Объект.Дата, "ДФ='dd.MM.yyyy ЧЧ:мм:сс'") + ?(Объект.Распечатан, "     ДОКУМЕНТ РАСПЕЧАТАН", "");
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ГУИД = "ОтказОтСоздания!!!" Тогда
		Отказ = истина;
		Возврат;
	КонецЕсли;
	
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбъем()
	Объект.Объем = Объект.Ширина * Объект.Длина * Объект.Высота / 1000000;
	Объект.ОбъемныйВес = Объект.Объем * 250;
КонецПроцедуры	

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	ПересчитатьОбъем();
КонецПроцедуры

&НаКлиенте 
Процедура ПересчитатьОбъемВСтроке()
	Элементы.ПараметрыГрузов.ТекущиеДанные.Объем = Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина / 1000000;
КонецПроцедуры	

&НаКлиенте
Процедура ПараметрыГрузовДлинаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовШиринаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовВысотаПриИзменении(Элемент)
	ПересчитатьОбъемВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ОбъемПриИзменении(Элемент)
	Объект.ОбъемныйВес = Объект.Объем * 250;
	Если Объект.Ширина <> 0  и Объект.Длина <> 0 И Объект.Высота <> 0 Тогда
		ИсходныйОбъем = Объект.Ширина * Объект.Длина * Объект.Высота;
		Коэфф = Объект.Объем / ИсходныйОбъем;
		Объект.Ширина = Объект.Ширина * Коэфф;
		Объект.Длина = Объект.Длина * Коэфф;
		Объект.Высота = Объект.Высота * Коэфф;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбъемныйВесПриИзменении(Элемент)
	Объект.Объем = Объект.ОбъемныйВес / 250;
	Если Объект.Ширина <> 0  и Объект.Длина <> 0 И Объект.Высота <> 0 Тогда
		ИсходныйОбъем = Объект.Ширина * Объект.Длина * Объект.Высота;
		Коэфф = Объект.Объем * 1000000 / ИсходныйОбъем;
		Объект.Ширина = Объект.Ширина * Коэфф;
		Объект.Длина = Объект.Длина * Коэфф;
		Объект.Высота = Объект.Высота * Коэфф;
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ПараметрыГрузовОбъемПриИзменении(Элемент)
	ИсходныйОбъем = Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина / 1000000;
	Коэфф = Элементы.ПараметрыГрузов.ТекущиеДанные.Объем / ИсходныйОбъем;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Ширина;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Длина = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Длина;
	Элементы.ПараметрыГрузов.ТекущиеДанные.Высота = Коэфф * Элементы.ПараметрыГрузов.ТекущиеДанные.Высота;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьГородОтправителя()
	Объект.ГородОтправителя = Объект.Отправитель.Город;
КонецПроцедуры

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	УстановитьГородОтправителя();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не ЗначениеЗаполнено(Объект.КонтактноеЛицоПолучателя) И ЗначениеЗаполнено(Объект.ФамилияПолучателя) И ЗначениеЗаполнено(Объект.ИмяПолучателя) и ЗначениеЗаполнено(Объект.ОтчествоПолучателя) И ЗначениеЗаполнено(Объект.ТелефонПолучателя) Тогда
		Если ЗначениеЗаполнено(Объект.Получатель) Тогда
			Об = Справочники.ЛМ_КонтактныеЛица.СоздатьЭлемент();
			Об.Владелец = Объект.Получатель;
			Об.Имя = Объект.ИмяПолучателя;
			Об.Фамилия = Объект.ФамилияПолучателя;
			Об.Отчество = Объект.ОтчествоПолучателя;
			Об.Телефон = Объект.ТелефонПолучателя;
			Об.Записать();
			ТекущийОбъект.КонтактноеЛицоПолучателя = Об.Ссылка;
		ИначеЕсли ЗначениеЗаполнено(Объект.НаименованиеКонтрагента) Тогда
			ОбКонтрагент = Справочники.ЛМ_Контрагенты.СоздатьЭлемент();
			ОбКонтрагент.Город = Объект.ГородПолучателя;
			ОбКонтрагент.Наименование = Объект.НаименованиеКонтрагента;
			ОбКонтрагент.ВидКонтрагента = Справочники.ЛМ_ВидыПлательщиков.НайтиПоРеквизиту("ГУИД","Recipient");
			ОбКонтрагент.Имя = Объект.ИмяПолучателя;
			ОбКонтрагент.Фамилия = Объект.ФамилияПолучателя;
			ОбКонтрагент.Отчество = Объект.ОтчествоПолучателя;
			ОбКонтрагент.Телефон = Объект.ТелефонПолучателя;
			ОбКонтрагент.ЮрФизЛицо = Справочники.ЛМ_ТипыКонтрагентовОтправителей.НайтиПоРеквизиту("ГУИД", "PrivatePerson");
			ОбКонтрагент.Записать();
			ТекущийОбъект.Получатель = ОбКонтрагент.Ссылка;
			ЗапросКонтактногоЛица = Новый Запрос;
			ЗапросКонтактногоЛица.Текст = 
			"ВЫБРАТЬ
			|	ЛМ_КонтактныеЛица.Ссылка
			|ИЗ
			|	Справочник.ЛМ_КонтактныеЛица КАК ЛМ_КонтактныеЛица
			|ГДЕ
			|	ЛМ_КонтактныеЛица.Владелец = &Владелец";
			ЗапросКонтактногоЛица.УстановитьПараметр("Владелец", ОбКонтрагент.Ссылка);
			Выборка = ЗапросКонтактногоЛица.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				ТекущийОбъект.КонтактноеЛицоПолучателя = Выборка.Ссылка;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеКонтрагентаОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьЗначение(Объект.Получатель);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФИОКОнтактногоЛица()
	Объект.ИмяПолучателя = Объект.КонтактноеЛицоПолучателя.Имя;
	Объект.ФамилияПолучателя = Объект.КонтактноеЛицоПолучателя.Фамилия;
	Объект.ОтчествоПолучателя = Объект.КонтактноеЛицоПолучателя.Отчество;
	Объект.ТелефонПолучателя = Объект.КонтактноеЛицоПолучателя.Телефон;
КонецПроцедуры	

&НаКлиенте
Процедура КонтактноеЛицоПолучателяПриИзменении(Элемент)
	ЗаполнитьФИОКОнтактногоЛица();
КонецПроцедуры

&НаСервере
Процедура ПроставитьТелефонОтправителя()
	Если ЗначениеЗаполнено(Объект.КонтактноеЛицоОтправителя.Телефон) тогда
		Объект.ТелефонОтправителя = Объект.КонтактноеЛицоОтправителя.Телефон;
	Иначе	
		Объект.ТелефонОтправителя = Объект.Отправитель.Телефон;
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура КонтактноеЛицоОтправителяПриИзменении(Элемент)
	ПроставитьТелефонОтправителя();
КонецПроцедуры
